# Brewfile — declarative install for Mac.
# Run with: brew bundle --file=mac/Brewfile
# Or:       make brew
#
# Comment out anything you don't want. Re-run is safe — idempotent.

# ─────────────────────────────────────────────────────────────
#  Taps (extra repos)
# ─────────────────────────────────────────────────────────────
# homebrew/bundle and homebrew/services were merged into Homebrew
# core in 2025 — no longer separate taps. Only add taps here for
# truly third-party formulae.

# Aerospace tiling window manager (third-party)
tap "Sanyam-G/switch"

# ─────────────────────────────────────────────────────────────
#  CLI tools
# ─────────────────────────────────────────────────────────────

# Core shell tools
brew "zsh"
brew "tmux"
brew "pam-reattach"  # lets Touch ID for sudo prompt inside tmux (see mac/enable-touchid-sudo.sh)
brew "sesh"          # smart tmux session manager (prefix+T picker; uses zoxide+fzf)
brew "stow"
brew "git"
brew "gh"
brew "starship"
brew "uv"
brew "atuin"

# Modern CLI replacements
brew "fzf"
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "zoxide"
brew "jq"
brew "yq"
brew "tldr"
brew "htop"
brew "btop"

# General utilities
brew "wget"
brew "curl"
brew "tree"
brew "watch"
brew "coreutils"            # GNU versions of date, ls, etc.
brew "gnu-sed"              # sed with GNU flags

# Network / SSH
brew "openssh"
brew "mtr"                  # better traceroute
brew "nmap"                 # network scanner
brew "iperf3"               # bandwidth test
brew "sshpass"

# Dev
brew "node"                 # for occasional npm tools
brew "ansible"              # if you ever run from Mac
brew "sqlite"               # cli for the register inventory DB (fssh preview)
brew "lazygit"
brew "lazysql"
brew "Adembc/homebrew-tap/lazyssh"
brew "yazi"

# Mac App Store CLI (required for `mas` lines below)
brew "mas"

# ─────────────────────────────────────────────────────────────
#  GUI Apps (casks)
# ─────────────────────────────────────────────────────────────

# Terminals
cask "ghostty"
cask "iterm2"               # backup terminal

# Browsers
cask "microsoft-edge"
cask "google-chrome"
cask "firefox"

# Communication
cask "zoom"
cask "microsoft-teams"

# M365
cask "microsoft-outlook"
cask "microsoft-teams"
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "onedrive"
cask "microsoft-365-copilot"  # AI assistant for M365 apps

# Productivity
cask "1password"
cask "1password-cli"        # for SSH agent + scripting
cask "alfred"              # Spotlight replacement — highly recommended
cask "Sanyam-G/switch/switch"              # better cmd-tab (per-window, not per-app)
cask "the-unarchiver"       # opens .rar, .7z, etc.
cask "appcleaner"           # uninstall apps properly
cask "maccy"                # clipboard manager
cask "hazel"                # auto file processing
cask "logi-options+"        # mouse manager
cask "obsidian"
cask "cleanshot"
cask "moom"                 # window manager


# Development
cask "visual-studio-code"
cask "github"               # GitHub Desktop, sometimes handy
cask "postman"              # API testing (or use Bruno: cask "bruno")
cask "dbeaver-community"
brew "duckdb"
cask "orbstack"
cask "tailscale-app"
cask "cyberduck"

# Remote / RDP / VNC
cask "windows-app" # Microsoft Remote Desktop, for RDP access to Windows machines 
cask "royal-tsx"
cask "vnc-viewer"            # for register VNC access
cask "core-tunnel"

# Media
cask "iina"

# Fonts (Nerd Fonts for terminal)
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-cascadia-code-nf"

# Utilities
cask "stats"                # menu bar system stats
cask "betterdisplay"        # control external monitor brightness from Mac
cask "autodesk-fusion"   # 3D modeling (free for personal use)
cask "hyperkey"              # remap caps lock to hyper key (ctrl+alt+cmd)
cask "macusb"


# ─────────────────────────────────────────────────────────────
#  Mac App Store apps
# ─────────────────────────────────────────────────────────────
# Comment out anything you don't have / want.
# To find IDs: mas search "<name>"

mas "Xcode",                     id: 497799835
mas "TestFlight",                id: 899247664
mas "Things 3",                id: 904280696   # task manager (paid)
mas "StopTheMadness Pro", id: 6471380298
mas "Peek", id: 1554235898
mas "1Password for Safari ", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Microsoft To Do", id: 1274495053
mas "HazeOver", id: 430798174
mas "Jump Desktop", id: 524141863
mas "Keka", id: 470158793
mas "Yesterday For Old Reddit", id: 1603279883
mas "Dato", id: 1470584107
mas "Folder Peek", id: 1615988943
mas "Pixelmator Pro", id: 1289583905
mas "Velja", id: 1607635845
mas "Dropover", id: 1355679052
mas "Mic Drop", id: 1489816366

# ─────────────────────────────────────────────────────────────
#  uv-managed Python CLI tools
# ─────────────────────────────────────────────────────────────

uv "ruff"                   # linter/formatter
uv "httpie"                 # better curl
uv "glances"                # system monitor
uv "ipython"                # better REPL
uv "yt-dlp"                 # video downloader (optional)
