# VS Code extensions
# Install all with:
#   cat extensions.txt | xargs -L1 code --install-extension       (Mac/Linux/WSL)
#   Get-Content extensions.txt | ForEach-Object { code --install-extension $_ }   (PowerShell)
#
# Or use the install scripts in this repo, which do it automatically.

# Python
ms-python.python
ms-python.vscode-pylance
ms-python.black-formatter

# Ansible
redhat.ansible
redhat.vscode-yaml

# PowerShell
ms-vscode.powershell

# Remote development
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-wsl
ms-vscode-remote.remote-containers

# Git
eamodio.gitlens
mhutchie.git-graph

# Editor enhancements
streetsidesoftware.code-spell-checker
editorconfig.editorconfig
usernamehw.errorlens
oderwat.indent-rainbow

# Markdown
yzhang.markdown-all-in-one
bierner.markdown-mermaid

# Themes / icons (optional but nice)
pkief.material-icon-theme

# Data files
mechatroner.rainbow-csv
mtxr.sqltools
mtxr.sqltools-driver-sqlite

# Docker
ms-azuretools.vscode-docker

# Productivity
gruntfuggly.todo-tree
alefragnani.bookmarks
